<template>
<div id="app">
	<div class="tabBox">
		<vu-tabs sticky color="#F20C59" height="0.44rem" >
			<vu-tab :title="tab" v-for="(tab,index) in tabs" :key="tabs.index">
				<helpCenterContent :tabcontents='tabcontents[index]'></helpCenterContent>
			</vu-tab>
		</vu-tabs>
	</div>
	
</div>
</template>

<script>
import helpCenterContent from '../components/helpCenterContent';
import vui from 'vui'
import { Tab } from 'vui';
import {mapGetters} from 'vuex'

export default {
  components: {
    Tab,
    helpCenterContent
  },
  data() {
    return {
    	tabs: ['美店运营', '商品管理', '佣金&提现', '返利帮助'],
    	tabcontents: [
    	{
    		'什么是美店':'用户在国美平台上开通的小店，上架平台商品，获取佣金，无需用户自己处理订单、仓储、物流。平台货源，无需囤货，商家跟进，售后无忧。',
    		'开美店的条件':'所有国美用户均可开通美店，全民均可参与其中。',
    		'关于美店设置':'通过我的美店进入美店设置，在美店设置中，店主可以随时根据当前的运营需要调整美店logo、设置美店介绍',
    		'哪里查看订单':'在我的美店中点击订单管理，进入订单管理页面，在订单管理页面可以查看待出库、已出库、已完成、售后订单列表，点击相应的订单可以查看该订单的订单详情。',
    		'如何查看我的美店效果':'在我的美店中点击美店预览，进入美店预览页面，即查看美店内所有商品，可选择按分类、上新顺序查看。',
    		'有哪些运营方法':'积极分享商品和美店，提高商品和美店的曝光度哦~',
    		'销售技巧：怎样分享商品不被朋友屏蔽/拉黑？':'建议把朋友圈进行用户群分组，根据不同属性的组别分享相应商品，每日可更新分享2-6个商品，分享时间间隔5个小时以上，这样朋友既不会感觉刷屏，同时能让朋友定时关注到您的商品。',
    		'销售技巧：什么文案能吸引点击？':'推广文案可以结合当下热门新鲜事件、网络用词等，同时也可以用自己平时说话的语气，提高与朋友互动性，这样效果会倍增。',
    		'销售技巧：如何提高转化？':'1）塑造自己的风格店铺，切忌对同一个用户群组什么商品都推广，捉住用户需求。（例如学生群体：刚发完四件套又发大家电，捉不住用户需求，转化自然不好。）2）朋友圈信息不能全是推广商品，同时需要推送风景、人物照片/热门新鲜事件等信息，让用户知道您是有生活情调的，不只是推广员，建议个人生活分享和商品分享的比例为3:7。3）提高与用户的互动性，如朋友圈评论、点赞、安慰、问候等，要相信只有和用户建立起信任关系，用户才会依赖于您，订单量自然节节上升。',
    		'如何挑选正确的推广商品?':'1、分析用户的需求 <br/> 您可以根据性别、年龄端，结婚、职业等因素划分你的朋友，进行用户群分组归类推广，同时配合自己独特的审美选择货品。<br/>2、根据季节性选择商品<br/> 要有针对性的选择商品，也可以根据最新时尚话题和当季季节来选择商品，提高转化。',
'一定要先上架商品到美店才能分享商品吗?':'不需要，添加商品时直接分享也可以赚取佣金。'
    	},{
    		'商品都从哪里来':'美店可上架商品均来自国美平台，仓储物流均由专业平台完成，十分可靠哦！',
    		'如何上架商品':'在我的美店点击“添加商品至美店”进入好货推荐频道，精选好货直接上架，或者进入商品管理，选择“添加商品”，直接搜索想要上架的商品，精准查找。',
    		'如何挑选商品':'好货推荐频道从最热、最新、佣金最高多个维度为您推荐优质商品，无需逐个操作，可将优质商品一键上架至美店，方便快捷。或者通过搜索精准寻找，搜索结果可以按销量、佣金排序，帮你挑选高佣金好口碑的优质商品。',
    		'美店商品该如何分享':'美店商品可以通过商品管理与商品详情页的分享控件分享至站内及其他社交平台',
    		'商品分类管理':'上架商品时，会带入商品原有分类，自动区分不同种类的商品。通过商品管理→分类管理，可以对分类进行编辑，自定义分类名称、调整商品所在分类、新增分类、设置首页展示。用心管理分类，美店首页大不一样哦~',
    		'商品是否有正品保障':'商品经由国美或其商家提供货源、发货、正品保证。',
    		'美店可以支持上架自有商品吗':'不可以，目前美店只支持上架国美APP商品。',
    		'添加的商品是否有数量限制':'没有数量限制',
    		'美店的挑货中心多久上架一次新货':'好货推荐页面精选标签每天更新，banner活动每周更新',
    		'商品的佣金是否不会改变':'会修改，商品佣金也是有周期的，偷偷告诉你，大促期间部分商品佣金会比较高哦。'
    	},{
    		'关于商品退换货':'美店订单产生退换货，佣金即失效',
    		'佣金是如何计算的':'商品标注佣金为最高可赚取的分享佣金，有顾客直接通过美店或分享链接购买，店主即可获得分享佣金',
    		'关于佣金返利模式':'美店店主可享受分享佣金、购买返利；举个栗子1：小明将该商品上架到美店，好友通过他的美店购买，小明即可获得分享佣金；举个栗子2：小明将该商品上架到美店，自己购买了美店商品，获得的就是分享佣金和购买返利之和。',
    		'关于佣金到账时间':'顾客在美店中购买商品，商品妥投后7天，佣金就进到美店账户里啦~商品妥投后即将拿到的佣金可以在“待入账佣金”中查看，小钱钱就在路上，不用着急呦~',
    		'关于美店账户':'美店账户中可以查看近7天收入、待入账、历史总额。近7天收入：最近一周入账佣金，跟上周比比看有没有进步。待入账：妥投后7天，佣金就进账啦，小钱钱就在路上，不用着急呦~历史总额：从开店起赚得的所有佣金，加油赚多多！',
    		'为什么实际获得佣金与跟页面显示不一致':'佣金=商品销售金额×佣金比例，同一型号、款式的商品也可能因为某一时段参与促销价格有所调整，从而导致实际获得佣金与页面显示不一致。',
    		'到哪里可以看见自己的返利金额':'在我的店铺页面和我的钱包页面可以看到我的金额',
    		'自己购买自己美店的商品也能获得佣金吗':'可以',
    		'关于数据统计。':'我的美店首页进入数据统计，可以查看前一天、过去7天以及过去30天的订单量、访客数和佣金，协助店主观测美店数据，调整运营方法。',
    		'为什么会有“已失效”的返利？':'国美大部分管理都是与订单挂钩的，因用户自己或者他人下单购买商品而产生； 已失效即待入账的返利对应订单发生取消、退换货行为，返利就会变成已失效状态，这部分钱平台会收回，用户无法获得。'
    	},{
    		'什么是“国美币”':'国美币是国美APP的虚拟货币，1国美币=1元人民币，可用于提现。',
    		'“国美币”可提现吗？':'可以',
    		'什么是“返利”？':'国美为会员提供的一种赚外快的途径——赚“返利”，在国美平台上，你可以通过很多途径赚到“返利”。“返利”以国美币的形式发放，会直接打入用户的国美币账户（1国美币=1元），你可以直接提现',
    		'获得返利的途径':'分享商品给朋友，如果商品有返利标示，朋友购买后，你可以得到返利。',
    		'怎样分享商品返利':'“直接分享”和“间接分享”商品，都可以获得返利。<br/>直接分享：你将商品（有返利标示）分享给小美，小美购买了，你可以获得返利。<br/>间接分享：你将商品（有返利标示）分享给小美，小美又分享给小明，小明购买了，这笔返利，你和小美两人按比例瓜分。<br/>注：直接分享和间接分享，你能获得的返利金额不同，具体以实际到账金额为准',
    		'是什么美店返利':'美店可以上架很多商品，如果商品带有佣金标示，每卖出一个商品，你都可以获得返利。<br/>美店可以进行个性化装修，有更强的号召力，是时候展示自己的个人魅力啦~'
    	}]
    }
  },
  computed: {
  	
  },
  create() {

  	
  }
}
</script>

<style lang='scss' rel="stylesheet/scss" type="text/css" scoped>
.tabBox{
	background-color:#F3F5F7;
	position: fixed;
	top:0;
	bottom:0;
	right:0;
	left:0;
}
</style>
<style lang='scss'>
.tabBox{
    height: 100%;
    overflow: hidden;
    .vu-tabs{
        height: 100%;
        box-sizing: border-box;
        position: relative;
        .vu-tabs__wrap{
            position: fixed;
            top: 0;
        }
        .vu-tabs__content{
            position: fixed;
            top: 0.44rem;
            bottom: 0;
            width: 100%;
            overflow-y: scroll;
            box-sizing: border-box;
            &::-webkit-scrollbar {/*滚动条整体样式*/
                width: 0;     /*高宽分别对应横竖滚动条的尺寸*/
            }
        }
    }
}

</style>
